{"meta":{"title":"Title TK","description":"Description tk."},"body":[{"section":"story","content":[{"type":"text","value":"I rupture my achilles in January."},{"type":"text","value":"I read a dozen or so books about walking journeys, couch bound most of the winter. I’m inspired. Obsessed?"},{"type":"text","value":"I decide to walk across Massachusetts. (Not now, of course, but when I’m upright again)."},{"type":"Figure","value":{"src":"assets/illos/cast.png","alt":"My right leg in a cast on a pillow."}},{"type":"text","value":"It is an idea born out of compromise. I’m not adventurous enough to hike the Appalachian Trail, but I still want a challenge."},{"type":"text","value":"I often visit family in Cambridge and drive back home to Great Barrington along the Mass Pike—a route that crosses the entire state in just over two hours. I’m curious what that is like on foot."},{"type":"text","value":"I talk about the walk a lot, with many different people. The more I talk, the more real it becomes."},{"type":"text","value":"Why? They ask."},{"type":"text","value":"Just for the heck of it, I say. (A line I steal from the incredible Grandma Gatewood–the first woman to thru-hike the Appalachian Trail. In the 1950s. In her sixties. With hardly any gear)"},{"type":"text","value":"With the support of my family and team at The Pudding, I <span class=strike>walk</span> plan, and plan, and plan some more. (Remember, not adventurous)."},{"type":"text","value":"Camping spots are neither pervasive nor convenient, and wild camping is a bit out of my comfort zone, so I map out the towns that have hotels, Airbnbs, or old friends."},{"type":"Figure","value":{"src":"assets/illos/map.png","alt":"My right leg in a cast on a pillow."}},{"type":"text","value":"Finding a safe and appealing route is a challenge. Unlike well-trodden paths like the Camino de Santiago or the Appalachian Trail, very few people have (publicly) walked across Massachusetts. But luckily I’m able to invoke the modern ritual of surveying thousands of pictures taken from miles above in orbit, while I sit comfortably on my couch, just to decide where to walk."},{"type":"text","value":"I spend hours on end fine-tuning and adjusting my route. Zoom, pan, click, repeat. I pack my bag (with a slight obsession to make it ultralight) and start my walk."},{"type":"Figure","value":{"src":"assets/images/pre-gear.jpg","alt":"All the gear laid out to be packed for the trip.","caption":"Tk."}},{"type":"text","value":"It takes me eight days to walk 160 miles across Massachusetts. I pass through 31 towns and take an estimated 368,000 steps."},{"type":"text","value":"That’s a lot of steps. A number that lives rent-free in my head for most of the walk."},{"type":"text","value":"What follows are my logs and observations."},{"type":"h3","value":"Day Zero: 368,000 steps left"},{"type":"text","value":"It is the night before the walk. I leave my home and set out for Cambridge. The hardest part of the walk might be getting in the car and saying goodbye to my daughter. She does her best to prevent me from leaving, and I let myself linger. We don’t spend a lot of time apart, so this is tough."},{"type":"Figure","value":{"src":"assets/illos/girl.png","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"The reality of what I’m doing doesn’t hit me until I drive through my namesake town of Russell. I’ll be staying there on my seventh night, if my body allows it. I’ve gotten my body to the point where I can do an 18-mile day, but never repeated. The thought of doing that nine consecutive days sounds absurd right now."},{"type":"text","value":"After an unremarkable ride, I arrive in Cambridge. It is surreal that I just spent two hours doing something that will take me nine days to complete."},{"type":"h3","value":"Day One: Still 368,000 steps left"},{"type":"text","value":"My mom joins me for the first few miles. (Hi mom!). We chitchat, and talk about how different these familiar places feel on foot versus by car. It's a nice send-off, but it feels a bit like my walk truly begins when we part ways in Waltham."},{"type":"Figure","value":{"src":"assets/illos/mom.png","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I have one simple rule: no music or podcasts. I want to embrace my surrounding environment and immerse myself in the walk. Experience the sounds, the sights, and my thoughts. The prospect is simultaneously daunting and exciting. What will I learn about myself, the world?"},{"type":"Figure","value":{"src":"assets/images/belmont-danny.jpg","alt":"Graffiti on a wall that says “Danny sux”","caption":"Tk."}},{"type":"text","value":"It feels good to walk past people sitting in traffic. But…it mostly feels anticlimactic so far. It’s just a regular day and people are going about their lives."},{"type":"Figure","value":{"src":"assets/images/waltham-office.jpg","alt":"An office building with cars in a parking lot.","caption":"Tk."}},{"type":"text","value":"After tripping on a raised piece of concrete, I introduce my second rule: no looking at the phone while walking."},{"type":"Figure","value":{"src":"assets/videos/waltham-tubeman.mp4"}},{"type":"text","value":"I have an unreasonably large dose of lasagna for lunch, then cross a highway, as sidewalks give way to my first paved rail trail. The first segment of the rail trail follows the power lines constant sun. Midday on a Friday is pretty quiet. I pass an occasional biker, jogger, or rollerblader. It is mostly crickets and birds."},{"type":"Figure","value":{"src":"assets/illos/lasagna.png"}},{"type":"Figure","value":{"src":"assets/images/waltham-bridge.jpg","alt":"Old train tracks on a bridge.","caption":"Tk."}},{"type":"text","value":"A quick water and snack refill in Wayland leads me to my first (user) navigation error. A trail is labeled as “in design.” Completely impassible, I make my first foray into the road. The tiny-shouldered, fast-moving traffic of route 20 quicken my steps. I’m not yet acclimated to cars and tracks rushing by a close distance. I leap into the first strip of high grass and litter I see, happy with my decision to wear pants."},{"type":"Figure","value":{"src":"assets/videos/wayland-murals.mp4"}},{"type":"text","value":"A mile ahead I return to the comfort of the rail trail, just as my body starts to give me signals it is ready to wrap things up for the day. The last few miles are so straight and repetitive that they crawl by."},{"type":"text","value":"I stop for the day after 18 miles. I’m a little bit proud, a little bit concerned with how sore I am, and a little bit somber about how unspectacular the whole thing feels. And despite my best efforts, I discover a blister developing on the bottom of my right pinky toe…"},{"type":"Figure","value":{"src":"assets/videos/sudbury-trees.mp4"}},{"type":"text","value":"I stay at a friend’s house and dine on more Italian-based carbs, beat a child and a grandma at ping pong, and sleep hard."},{"type":"Figure","value":{"src":"assets/illos/pingpong.png","alt":"Tk.","caption":"Tk."}},{"type":"h3","value":"Day Two: 325,910 steps left"},{"type":"text","value":"The blister tended to, I set off feeling better than expected (thanks magnesium, I think), this time accompanied by my good friend I don’t see often enough. We chitchat, and crush a half-dozen miles of rail-trail before parting ways after an early lunch. No more companions after this."},{"type":"Figure","value":{"src":"assets/illos/pal.png","alt":"Tk.","caption":"Tk."}},{"type":"Figure","value":{"src":"assets/images/hudson-protest.jpg","alt":"Kid’s car in a yard.","caption":"Tk."}},{"type":"Figure","value":{"src":"assets/images/hudson-toycar.jpg","alt":"Kid’s car in a yard.","caption":"Tk."}},{"type":"text","value":"I pass through Hudson and find it jarring going from rail trail to sidewalk to shoulder to woods in the span of a couple hours. Each setting requires a different mindset. Hearing every sound in the woods alone is intimidating at first. Once I settle in though, I realize how little my mind has to work compared to the constant stimulation of the road."},{"type":"Figure","value":{"src":"assets/videos/bolton-traffic.mp4"}},{"type":"Figure","value":{"src":"assets/images/bolton-happiness.jpg","alt":"Two street signs and a sign that says happiness pointing in both directions.","caption":"Tk."}},{"type":"text","value":"It is just a short jaunt through the woods of Bolton, but I swear I can hear a trickle of not-quite-Green Day filtering through the trees."},{"type":"Figure","value":{"src":"assets/illos/greenday.png","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"Out of the woods and down the road I come across a festive Autumn scene: beer, cider donuts, lots of people, a giant corn maze, and a band (the perpetrators of the Basket Case rendition)."},{"type":"Figure","value":{"src":"assets/images/bolton-mailboxes.jpg","alt":"Mailboxes.","caption":"Mailboxes."}},{"type":"Figure","value":{"src":"assets/images/bolton-woodsbridge.jpg","alt":"A bridge in some woods.","caption":"Tk."}},{"type":"text","value":"I try to buy a cider donut but they only sell them by the bag. They tell me to just take the rest home, but I say that is still over 300,000 steps away."},{"type":"Figure","value":{"src":"assets/illos/donuts.png","alt":"Tk.","caption":"Tk."}},{"type":"Figure","value":{"src":"assets/images/bolton-cornmaze.jpg","alt":"A field of corn.","caption":"Tk."}},{"type":"text","value":"Back into the woods where I belong. I can’t get over how many squirrels I’ve seen or heard. We are really just living in their world."},{"type":"Figure","value":{"src":"assets/images/clinton-birdrock.jpg","alt":"Tk.","caption":"Tk."}},{"type":"Figure","value":{"src":"assets/videos/clinton-waterfall.mp4"}},{"type":"text","value":"The reservoir in Clinton is vast and beautiful, but the last few miles of the day feel the same as the day before."},{"type":"Figure","value":{"src":"assets/videos/clinton-dam-walk.mp4"}},{"type":"text","value":"My body aches when I finish, and the blister is a bit more gnarly. I dine on Cup Noodles in my hotel room, and sleep little, mostly thanks to my upstairs neighbor who seems to be trying to get their own steps in overnight."},{"type":"Figure","value":{"src":"assets/images/clinton-boardedupwalk.jpg","alt":"Tk.","caption":"Tk."}},{"type":"h3","value":"Day Three: 283,820 steps left"},{"type":"text","value":"Every step hurts on the pinky toe. After an hour or so I get used to it and carry on."},{"type":"text","value":"I visit a scenic porta-potty in the middle of nowhere next to a railroad. Royal Flush is the name. I appreciate a good double-entendre. I keep the door open for the full experience."},{"type":"Figure","value":{"src":"assets/images/west-bolyston-potty.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"Today I learn about the value of a walking stick. I go through a few, getting a feel for my desired size and weight. A stick is great for some aid up a hill, twirling like a baton, or giving some confidence to marginally protect myself in case one of the infinite barking dogs I pass decides I’m a problem."},{"type":"Figure","value":{"src":"assets/images/west-bolyston-birds.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I encounter endless stretches of barely traveled roads. By this point, the walk loses the romantic light I painted it in before I left. Step after step, road after road. It’s nothing special, but it’s nothing unsatisfactory either. It’s just walking. With the sole purpose of my day being to simply walk, my emotions oscillate from delight, to dread, to indifference."},{"type":"Figure","value":{"src":"assets/images/sterling-straightroad.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"Some close friends and family are tracking my progress, thanks to space technology yet again. I get a text from a friend alerting me to a shortcut. Ford the river he says. I’ll take a peek, I say."},{"type":"Figure","value":{"src":"assets/videos/holden-stream.mp4"}},{"type":"text","value":"I sneak off the trail and find a suitable place to ford the river (it is a shallow stream). I worry about getting my feet wet which would exacerbate my blister situation, but I go for it nonetheless. I butt-scoot across a downed tree, hop a couple of slippery rocks, and am clear to the other side. It feels amazing to shave off a couple miles."},{"type":"Figure","value":{"src":"assets/images/holden-railtrailwoods.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I treat myself to some pizza and a Snickers at the only store I pass on today’s walk. While airing out my feet, a 10-minute long motorcycle parade passes by, providing the auditory antithesis to the previous hours of squirrels, birds, and crickets."},{"type":"Figure","value":{"src":"assets/videos/holden-motorcycle.mp4"}},{"type":"text","value":"The day ends and I stay with my childhood neighbor that I haven’t seen in over 20 years. We cram two decades of catch-up into a couple hours of conversation while her daughter watches Bluey. I sing the theme song at the start of each new episode because I miss my daughter."},{"type":"text","value":"Lasagna again. 10 out of 10."},{"type":"h3","value":"Day Four: 244,260 steps left"},{"type":"text","value":"Boredom gives way to invention. I come up with various games to help pass the steps."},{"type":"text","value":"Acorn Smash™: Sash an acorn with your walking stick, in stride. Improves hand-eye coordination."},{"type":"text","value":"Acorn Dodgeball™: Avoid the falling acorns being tossed at you by squirrels in trees."},{"type":"text","value":"Acorn Baseball™: Stuff a bunch of acorns in your pockets and bat at them with your walking stick."},{"type":"Figure","value":{"src":"assets/images/rutland-railtrailtree.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I feel much safer than I anticipated on roads. On quiet backroads it’s easy enough to listen for cars, and cross to the other side to avoid confrontation. The busier roads usually have wide shoulders or someone’s yard to utilize. For an unavoidable tight squeeze, I make myself as seen as possible before hugging the edge of the road and whispering the magic spell “please don’t hit me.”"},{"type":"text","value":"I see a sign advertising honey pointing the direction I’m going. Pretty excited."},{"type":"Figure","value":{"src":"assets/images/oakham-honey.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"It has been a few miles and no honey. I’m feeling misled."},{"type":"text","value":"A second honey sign appears. I forget that their intended audience is cars, not slow pedestrians."},{"type":"text","value":"I’ve reached the honey. This jar is much too big for me. I hope I don’t regret it like the donuts…"},{"type":"text","value":"I’m sitting in front of a post office, and not a single wave or smile is given or returned. Just blank stares. This seems to be the norm for encountering a pedestrian in the land of cars."},{"type":"text","value":"I find a stick: light but strong, shoulder high, smooth, with a thickness that fits my grip like a glove. A bit of refining with my knife (that I now don’t regret bringing) and it might be a keeper."},{"type":"Figure","value":{"src":"assets/images/northampton-stick.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I see someone approaching 1,000 feet ahead. For a brief moment I’m convinced it is a parallel universe version of myself (he has a matching fluorescent yellow hoodie, and I haven’t had a Snickers in a while). I think about what I’m going to say as he approaches, and  decide to ask how his blister is doing."},{"type":"Figure","value":{"src":"assets/images/oakham-boggs.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"We pass each other, but it isn’t me. We do the barely-noticable head-nod hello, and I carry on in my own universe."},{"type":"text","value":"Beer Can Bingo™: See if you can find every popular domestic beer on a single street."},{"type":"Figure","value":{"src":"assets/videos/beer.mp4"}},{"type":"text","value":"In New Braintree, I stop at what I’m hoping is a farm stand with some food, but strike out. This was my plan for lunch. Twenty minutes later, another farm stand, but this one chock full of things to eat. I meet a farmer named Herb (perfect). He tells me his family tree connects him to everyone from the King of England to the first person who died in the Revolutionary War."},{"type":"Figure","value":{"src":"assets/images/new-braintree-farmstand.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"The blister hasn’t subsided. I just have learned to live with it, hope it doesn’t get infected before the walk ends."},{"type":"Figure","value":{"src":"assets/videos/new-braintree-road.mp4"}},{"type":"h3","value":"Day Five: 208,840 steps left"},{"type":"text","value":"The morning brings a heavy fog that blankets the roads and fields. Today I’ll attempt over 20 miles for the first time. I’ll see if my body is up to the task."},{"type":"Figure","value":{"src":"assets/images/new-braintree-fog.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"Nearly all roads today. With the poor visibility I break out my bike lights and clip them on my straps to give the cars an extra heads-up that I exist."},{"type":"text","value":"Someone left a furlong of burnt rubber on the unblemished asphalt. I wonder if every time they return to this spot they say, Oh yeah that was all me."},{"type":"text","value":"The fog lifts after a couple hours and I settle into the groove of long and winding back roads. They are a familiar and tranquil routine at this point. The only vehicle I see for a few miles is a mail truck that passes me in both directions."},{"type":"text","value":"I approach the town of Ware."},{"type":"text","value":"\\Costello: You’re walking to where?"},{"type":"text","value":"\\Abbott: Ware."},{"type":"text","value":"\\Costello: That’s what I want to know. Where?"},{"type":"text","value":"\\Abbott: That’s right."},{"type":"text","value":"\\Costello: What town are you going to?"},{"type":"text","value":"\\Abbott: Ware."},{"type":"text","value":"\\Costello: In Massachusetts."},{"type":"text","value":"\\Abbott: Yes."},{"type":"text","value":"\\Costello: Here is a map. Show me where."},{"type":"text","value":"\\Abbott: It’s right there."},{"type":"text","value":"\\Costello: Where is right there?"},{"type":"text","value":"\\Abbott: Yes."},{"type":"text","value":"\\Costello: Where?"},{"type":"text","value":"\\Abbott: That’s right."},{"type":"text","value":"\\Costello: Let’s try this again. Where is your first stop?"},{"type":"text","value":"\\Abbott: Oh, absolutely."},{"type":"text","value":"\\Costello: Absolutely where?"},{"type":"text","value":"\\Abbott: You got it."},{"type":"text","value":"\\Costello: *Flips table*."},{"type":"text","value":"I can’t stop thinking about the word traipse and how it relates to trespass. I need to investigate the etymological interplay when I get back. I’m not sure of the definition, but I’ve decided I must be traipsing, it just feels right."},{"type":"Figure","value":{"src":"assets/images/ware-clowns.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"More miles-long stretch of backroad with no car or person in sight, though plenty of houses. I see a lady on a porch up ahead and get excited about the imminent interaction."},{"type":"text","value":"I pass by without notice. It takes a full minute to go, yet she is looking down at her phone the whole time."},{"type":"text","value":"I find I’m taking quite fewer photos, especially in the second half of the day. I think the number of photos is inversely proportional to the discomfort of my blister and weariness of my feet and legs."},{"type":"Figure","value":{"src":"assets/videos/belchertown-bug.mp4"}},{"type":"text","value":"I appear to be at an impasse for the second time on this walk. The path on my navigation is clearly not a path in the real world. The trespassing signs assure me it belongs to someone else, not traipsers."},{"type":"text","value":"Insert Michael Scott GIF."},{"type":"text","value":"I can either double back until I rejoin the main road, or *gulp* trespass and hope for the best (i.e., to not get shot). I choose the latter, and take a direct line through the woods, staying as far from the houses as possible, until I hit the road again."},{"type":"text","value":"I make it through with just a couple scratches and return to the road, briefing a sigh of relief. You would think that trespassing is the most violated law in Massachusetts with the number of signs I’ve seen."},{"type":"text","value":"I think I’ve seen more private property signs than squirrels at this point, which is saying something. If I were tallying things, there would be a tight race between squirrels, trespassing signs, and beer cans."},{"type":"Figure","value":{"src":"assets/images/sudbury-posted.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"The clouds disperse, the light falls gently through the trees, and I decide it’s a sign that having avoided adding more miles to my already long day, the rest will go swimmingly."},{"type":"text","value":"That is until the voice of the navigation penetrates the silence to remind me that I still have to follow this road for 1.8 miles until my next turn. I’ve felt like I’ve been on this road for ages, and the cold delivery can be a bit soul-crushing at times. But I stay positive because. I deploy the carrot-and-stick tactic, in the form of my last snack–a bag of Cheez-its (and a Snickers bar)–that I devour at the three-miles-left milestone."},{"type":"Figure","value":{"src":"assets/images/belchertown-pharoah.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I arrive in Belchertown, tend to my blister, and head over to the local pub for half-off wings night. I sit next to an old fellow and he is the most excited person I’ve met so far about my walk. He can’t believe it. He drives up from Springfield for the wings here and a bit of Keno."},{"type":"text","value":"I down a Guiness, a dozen wings, and personal pizza. The old fellow tries to rile up the bartenders about my journey but they don’t share his enthusiasm."},{"type":"text","value":"I finally introduce myself, I’m Russell."},{"type":"text","value":"Me too! He says."},{"type":"text","value":"I knew there was something good about him. He is only the third Russell I’ve met in my life. We part ways and I go to bed, stuffed but encouraged having crossed the halfway point."},{"type":"h3","value":"Day Six: 161,690 steps left"},{"type":"Figure","value":{"src":"assets/images/belchertown-trash.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"Back on a rail trail, and I remember how nice it is to shut off the traffic-watching part of my brain. No more worrying, just walking."},{"type":"Figure","value":{"src":"assets/images/amherst-pavedrailtrail.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I fill the stretches of marked quarter-miles by counting my steps at different paces. They fall between 550 and 600, or about 2,300 steps per mile."},{"type":"text","value":"I practice walking with my eyes closed on the straight aways. This is harder than I anticipate. I veer off the path within 20 steps nearly every time."},{"type":"Figure","value":{"src":"assets/images/amherst-beaver.jpg","alt":"Tk.","caption":"Tk."}},{"type":"Figure","value":{"src":"assets/images/hadley-cows.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"19 miles in and I’m feeling a bit of a pull on my achilles for the first time. Don’t tell my PT. Nothing serious, but it has been mostly out-of-mind for the whole walk, overshadowed by the feet."},{"type":"Figure","value":{"src":"assets/videos/hadley-hawk.mp4"}},{"type":"text","value":"My friend–safe to call a musicophile–gives me a call and his first question is, What are you listening to?"},{"type":"text","value":"I tell him nothing, but I am often my own jukebox. I’m in my sad-boy-90s phase of the walk, so I tell him I was just whistling Between the Bars by Elliot Smith. I wish I was recording them, it could make for exceptionally niche playlist."},{"type":"text","value":"An small sample of hits from the road, usually inspired by what’s literally in front of me:"},{"type":"text","value":"Stopping by Woods by The Omaha Folk (“the woods are lovely, dark and deep”)"},{"type":"text","value":"Doll Parts by Hole (“someday you will ache like I ache”)"},{"type":"text","value":"Break My Stride by Matthew Wilder (“Ain't nothin' gonna break my stride. Nobody gonna slow me down. Oh no, I got to keep on moving.”)"},{"type":"text","value":"Armchair by The Omaha Folk (I see lots of “armchairs left by the road”)"},{"type":"text","value":"Everything is Honey by Winnie the Pooh (recall the honey episode)"},{"type":"text","value":"The Sign by Ace of Base (I see a lot of signs)"},{"type":"text","value":"We Are Not Going to Make It by The Presidents of the United States of America (self-doubt)"},{"type":"text","value":"This Must Be the Place by The Talking Heads (“home is where I want to be”)"},{"type":"text","value":"Basket Case by Green Day (recall the cover band)"},{"type":"text","value":"Jackson by Johnny Cash and June Carter Cash (cows in fields I guess)"},{"type":"text","value":"Damn I Wish I Was Your Lover by Sophie B. Hawkins (“damn!” - beaver dams)"},{"type":"text","value":"Between the Bars by Elliot Smith (no idea why)"},{"type":"Figure","value":{"src":"assets/images/hadley-bridge.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I spend the night with my family in Northampton. They come to give me a little morale boost before my final days. I’m most excited that my daughter enjoys some sweet potato fries at the restaurant. A big win to get those back in the food rotation."},{"type":"h3","value":"Day Seven: 117,990 steps left"},{"type":"text","value":"The hips and feet are tender this morning, but I’m feeling good with a sub-20 mile day ahead of me. I do have a bit of extra packweight today–a nice assortment of bars from the grocery store–since I’ll be staying on a farm a couple miles from town."},{"type":"Figure","value":{"src":"assets/videos/easthampton-fan.mp4"}},{"type":"text","value":"I observe something I’m calling a distance warping effect. I’m over 75% of the way through this walk and it doesn’t feel like I’ve gone very far because my mind only holds context for a day’s worth of walking. It doesn’t feel like I’ve gone a hundred miles."},{"type":"text","value":"I come to terms that there aren’t any grand epiphanies on the horizon. Not that I expect them, but I figure the scope of this experience might elicit one or two. Instead it’s just a lot of walking."},{"type":"text","value":"Self-doubt has entered the chat. Perhaps the book I was reading last night planted the seed. I’m more aware of the discomfort in my right foot than usual. I’m only at 10 miles and I have my first big incline of the walk approaching."},{"type":"text","value":"I’m truly traipsing this afternoon. I don’t know if I have it in me. It occurs to me I could get a ride home in under an hour."},{"type":"Figure","value":{"src":"assets/images/book.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"Halfway up the long incline I stop to go to the bathroom and refill my water in an empty multi-use building in Montgomery. As I exit the bathroom, I startle a man that appears out of nowhere."},{"type":"text","value":"I was about to lock this place up, good thing I ran into you, he says."},{"type":"text","value":"He offers to refill my water bottle and we chat a bit about the walk, and how he’s done the 100-mile wilderness section of the AT. When I leave, I think about how discouraging it would have been trapped in the building for a night."},{"type":"Figure","value":{"src":"assets/images/montgomery-dog.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I head back out and I make it over the mini-mountain. I nearly jog down the equally long descent into the valley where I reach the farm. I run into a guy."},{"type":"text","value":"Is this your farm? I ask."},{"type":"text","value":"Nah I’m just living here he says."},{"type":"text","value":"He shows me the outhouse and I make my way to my cabin (shed with bed) that I don’t leave the rest of the afternoon. I stay the night amongst sheep and cows. I eat two bars and a muffin, and go to sleep shortly after the sun sets."},{"type":"h4","value":"Day Eight: 77,740 steps left"},{"type":"text","value":"I wake up before 6am, eat my last energy bar, and strike out for the road an hour earlier than usual. Carpe diem baby."},{"type":"text","value":"I cross into the town of Russell, and for the first time I feel that I might actually do it."},{"type":"Figure","value":{"src":"assets/images/russell-railyard.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"The day begins with a steady ascent for the first six miles. With some narrow shoulders and switchbacks, I’m constantly listening for the car or truck that comes every few minutes to get on the opposite side of the road."},{"type":"text","value":"I hear the hum of the Mass Pike ahead and which gives me energy. It is the last big landmark milestone in my mind."},{"type":"text","value":"I still haven’t reached the highway a mile later. It turns out that was a very distant hum, though I’m impressed by how far the noise can carry down the mountain."},{"type":"Figure","value":{"src":"assets/videos/blandford-highway.mp4"}},{"type":"text","value":"I stop for second breakfast at the country store in Blandford. I hate to admit it, but a small hokey plaque deeply resonates with me: Live Simply, Expect Little, Give Much (Norman Vincent Peale, I later find out). I consider this phrase for a good chunk of today’s walk."},{"type":"text","value":"The waitress puts a coffee in front of me before taking my order, and I don’t want to be wasteful or rude so I drink it. I only drink decaf. We’ll see how this goes."},{"type":"Figure","value":{"src":"assets/images/blandford-fish.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"My first roadside interaction–eight days into the walk–comes in Otis."},{"type":"text","value":"Hey man, you need a cold water?"},{"type":"text","value":"I’m so surprised by the gesture that I instantly decline."},{"type":"text","value":"No thanks but I appreciate it!"},{"type":"text","value":"He pulls away and I don’t know why I turn it down."},{"type":"Figure","value":{"src":"assets/images/otis-skeleton.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I’m quickly approaching my end goal for the day, but now that I’m nearing my home turf adrenaline is kicking in. Or it might be the coffee."},{"type":"Figure","value":{"src":"assets/images/monterey-mirror.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"It is only 2pm, and regardless of what is fueling me now, I think I can make it home. I chew on this idea for a bit and resolve to make it come true. The idea of sleeping in my own bed seals the deal, and I check my maps to see if it is feasible before sunset. With a couple of small breaks I can do it. I set aside the fact that it is another 14 miles, which will put me over 33 miles for the day. I eat my (hopefully last) Snickers and get after it."},{"type":"Figure","value":{"src":"assets/videos/otis-down.mp4"}},{"type":"text","value":"I go into a sort of trance. I walk, and walk, and walk. I take a single five-minute break to refill my water and stretch, then walk some more. My body doesn’t feel like much at all, I’m just a robot going through the motions. I’m sure my feet hurt but I can deal with that tomorrow."},{"type":"Figure","value":{"src":"assets/images/monterey-speed.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"My wife reminds me not to overdo it. I tell her I’m listening to my body, though in reality I’m just ignoring it."},{"type":"Figure","value":{"src":"assets/images/great-barrington-sunset.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"The distance warp effect returns when I cross into Great Barrington. My judgement of time and distance is so dialed into my car trips along this route that it just feels all wrong on foot. The two-minute drive between the ski slope and the chinese restaurants takes me an hour and messes with my head a little."},{"type":"text","value":"Just as the sun is setting I reach the outskirts of downtown where the sidewalk begins. I walk directly to the restaurant where my wife is working to surprise her (and eat all the food)."},{"type":"Figure","value":{"src":"assets/images/great-barrington-nocomply.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I see some folks I know and I join them. They lovingly interrogate my walk as I inhale what’s put in front of me. It is the best way to come back. I don’t stay too long since I still have about two miles before home."},{"type":"text","value":"This is my first night walk, and it is perfect. I stroll up the hill to my home, open the door, and just sit on my steps, not quite sure what to do with myself for a while. I’m exhausted, but proud. More so for the fact that I did 33.5 miles today than anything else."},{"type":"Figure","value":{"src":"assets/images/great-barrington-tunnel.jpg","alt":"Tk.","caption":"Tk."}},{"type":"text","value":"I eventually muster up some energy to take off my shoes. It’s not great under there, but I don’t plan on using my feet for a few days."},{"type":"Figure","value":{"src":"assets/images/great-barrington-shadow.jpg","alt":"Tk.","caption":"Tk."}},{"type":"h3","value":"One Week Post-Walk"},{"type":"text","value":"The farthest I’ve walked is between the car and the grocery. Dog-sitting for a friend today forces me back to the road, by foot. I put on shoes (for the first time) and head outside. My body is mostly recovered, and a short, leisurely, destination-free walk is unexpectedly delightful."},{"type":"text","value":"A lot of people are curious about how my journey went. How was your walk? They ask."},{"type":"text","value":"Mostly good, I say."},{"type":"text","value":"I know that isn’t enough, but it is hard to reduce 368,000 steps to words. It was difficult, it was peaceful, it was scary, it was fun."},{"type":"text","value":"That was my walk. Thanks for reading."}]}]}